Repository: pandark/python-docs-fr
Catalog: c-api/slice.po
Languages: fr

source: Slice Objects
fr: Objet slice

source: The type object for slice objects. This is the same as :class:`slice` in the Python layer.
fr: L'objet type des objets slice. C'est la même chose que :class: slice dans la couche Python.

source: Return true if *ob* is a slice object; *ob* must not be *NULL*.
fr: Renvoie vrai si *ob* est un objet slice ; *ob* ne doit pas être *NULL*.

source: Return a new slice object with the given values. The *start*, *stop*, and *step* parameters are used as the values of the slice object attributes of the same names. Any of the values may be *NULL*, in which case the ``None`` will be used for the corresponding attribute. Return *NULL* if the new object could not be allocated.
fr: Renvoie un nouvel objet slice avec les valeurs données. Les paramêtres *start*, *stop*, et *step* sont utilisées comme valeur des attributs de l'objet slide du même nom. N'importe laquelle de ces valeurs peut être *NULL*, auquel cas l'objet ``None`` sera utilié pour les attributs correspondants. Renvoie *NULL* si le nouvel objet ne peut pas être alloué.

source: Retrieve the start, stop and step indices from the slice object *slice*, assuming a sequence of length *length*. Treats indices greater than *length* as errors.
fr: Récupère les indices start, stop et step de l'objet slice *slice*, en supposant une séquence de longueur *length*. Traite les indices supérieur à *length* comme des erreurs.

source: Returns ``0`` on success and ``-1`` on error with no exception set (unless one of the indices was not :const:`None` and failed to be converted to an integer, in which case ``-1`` is returned with an exception set).
fr: Renvoie ``0`` en cas de réussite ou ``-1`` en cas d'erreur sans exception définie (sauf si l'un des indices n'était pas :const:`None` et n'a pas pu être converti en un entier, auquel cas ``-1`` est renvoyé avec une exception définie).

source: You probably do not want to use this function.
fr: Vous ne voulez probablement pas utiliser cette fonction.

source: The parameter type for the *slice* parameter was ``PySliceObject*`` before.
fr: Le paramètre type du paramètre slice était auparavant ``PySliceObject*``.

source: Usable replacement for :c:func:`PySlice_GetIndices`. Retrieve the start, stop, and step indices from the slice object *slice* assuming a sequence of length *length*, and store the length of the slice in *slicelength*. Out of bounds indices are clipped in a manner consistent with the handling of normal slices.
fr: Peut être utilisé à la place de :c:func:`PySlice_GetIndices`. Récupère les indices start, stop et step de l'objet slice *slice*, en supposant une séquence de longueur *length*, et enregistre la longueur de la slice dans *slicelength*. Les indices hors des

source: Returns ``0`` on success and ``-1`` on error with exception set.
fr: Renvoie ``0`` en cas de réussite et ``-1`` en cas d'erreur avec une exception définie.

source: This function is considered not safe for resizable sequences. Its invocation should be replaced by a combination of :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices` where ::
fr: Cette fonction est considérée non-sure pour les séquence redimentionnables. Son invocation devrait être remplacée par une combinaison de :c:func:`PySlice_Unpack` et :c:func:`PySlice_AdjustIndices` où ::

source: is replaced by ::
fr: est remplacé par ::

source: If ``Py_LIMITED_API`` is not set or set to the value between ``0x03050400`` and ``0x03060000`` (not including) or ``0x03060100`` or higher :c:func:`!PySlice_GetIndicesEx` is implemented as a macro using :c:func:`!PySlice_Unpack` and :c:func:`!PySlice_AdjustIndices`. Arguments *start*, *stop* and *step* are evaluated more than once.
fr: Si ``Py_LIMITED_API`` n'est pas défini, ou est définie à une valeur entre ``0x03050400`` et ``0x03060000`` (non-inclus), ou supérieure ou égale à ``0x03060100``, :c:func:`!PySlice_GetIndicesEx` est implementé en tant que macro en utilisant :c:func:`!PySlice_Unpack` et :c:func:`!PySlice_AdjustIndices`. Les arguments *start*, *stop* et *step* sont évalués plus d'une fois.

source: If ``Py_LIMITED_API`` is set to the value less than ``0x03050400`` or between ``0x03060000`` and ``0x03060100`` (not including) :c:func:`!PySlice_GetIndicesEx` is a deprecated function.
fr: Si ``Py_LIMITED_API`` est défini à une valeur inférieure à ``0x03050400``, ou entre ``0x03060000`` et ``0x03060100`` (exclus), :c:func:`!PySlice_GetIndicesEx` est une fonction dépréciée.

source: Extract the start, stop and step data members from a slice object as C integers. Silently reduce values larger than ``PY_SSIZE_T_MAX`` to ``PY_SSIZE_T_MAX``, silently boost the start and stop values less than ``PY_SSIZE_T_MIN`` to ``PY_SSIZE_T_MIN``, and silently boost the step values less than ``-PY_SSIZE_T_MAX`` to ``-PY_SSIZE_T_MAX``.
fr: Extrait les données membres start, stop et step de l'objet slice comme des entiers C. TODO

source: Return ``-1`` on error, ``0`` on success.
fr: Renvoie ``-1`` en cas d'erreur, ``0`` en cas de réussite.

source: Adjust start/end slice indices assuming a sequence of the specified length. Out of bounds indices are clipped in a manner consistent with the handling of normal slices.
fr: Ajuste les indices start/end pour une séquence de la taille spécifiée. Les indices hors des bornes sont raccourci d'une manière cohérente avec la manipulation de slices normales.

source: Return the length of the slice. Always successful. Doesn't call Python code.
fr: Renvoie la longueur de la slice. Réussit toujours. N'appelle pas de code Python.

source: Ellipsis Object
fr: Objet ellipsis

source: The Python ``Ellipsis`` object. This object has no methods. It needs to be treated just like any other object with respect to reference counts. Like :c:data:`Py_None` it is a singleton object.
fr: L'bojet ``Ellipsis`` de Python. Cet objet n'a pas de méthode. Il doit être traité comme n'importe quel autre objet en ce qui concerne le compteur de références. Comme :c:data:`Py_None`, c'est un objet singleton.
